{
  "format": "layers-model",
  "generatedBy": "JasmaniAI",
  "convertedBy": "manual",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "module": "keras.layers",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                3,
                5
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer"
            },
            "registered_name": null
          },
          {
            "module": "keras.layers",
            "class_name": "LSTM",
            "config": {
              "name": "lstm_layer",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "relu",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            },
            "registered_name": null,
            "build_config": {
              "input_shape": [
                null,
                3,
                5
              ]
            }
          },
          {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
              "name": "hidden_layer",
              "trainable": true,
              "dtype": "float32",
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
              "input_shape": [
                null,
                64
              ]
            }
          },
          {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
              "name": "output_layer",
              "trainable": true,
              "dtype": "float32",
              "units": 5,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
              "input_shape": [
                null,
                32
              ]
            }
          }
        ]
      },
      "keras_version": "2.15.0",
      "backend": "tensorflow"
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "lstm_layer/kernel",
          "shape": [
            5,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_layer/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_layer/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "hidden_layer/kernel",
          "shape": [
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "hidden_layer/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "output_layer/kernel",
          "shape": [
            32,
            5
          ],
          "dtype": "float32"
        },
        {
          "name": "output_layer/bias",
          "shape": [
            5
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}